Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	// Тип можно изменять только пока характеристика нигде не используется.
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Характеристики.ТипЗначения КАК ТипЗначения
		|ИЗ
		|	ПланВидовХарактеристик.ТехническиеХарактеристикиОборудования КАК Характеристики
		|ГДЕ
		|	Характеристики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтарыйТипЗначения = Выборка.ТипЗначения;
	КонецЕсли;
	
	Если СтарыйТипЗначения = ТипЗначения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Значения.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЗначенияТехническихХарактеристикМоделей КАК Значения
		|ГДЕ
		|	Значения.Характеристика = &Характеристика";
	
	Запрос.УстановитьПараметр("Характеристика", Ссылка);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Нельзя изменить тип характеристики, поскольку для нее уже существуют значения.";
	КонецЕсли;
	
КонецПроцедуры