&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияХарактеристик();
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьЗначенияХарактеристик()
	
	ЗначенияХарактеристик.Очистить();
	
	// Технические характеристики используются только для моделей оборудования.
	Если Объект.Категория.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.МодельОборудования Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Характеристики.Характеристика КАК Характеристика,
		|	Характеристики.Характеристика.ЕдиницаИзмеренияТекста КАК ЕдиницаИзмерения,
		|	Значения.Значение КАК Значение
		|ИЗ
		|	Справочник.КатегорииНоменклатуры.Характеристики КАК Характеристики
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияТехническихХарактеристикМоделей КАК Значения
		|		ПО Характеристики.Характеристика = Значения.Характеристика
		|			И Значения.МодельОборудования = &МодельОборудования
		|ГДЕ
		|	Характеристики.Ссылка = &Категория
		|
		|УПОРЯДОЧИТЬ ПО
		|	Характеристики.Порядок";
	
	Запрос.УстановитьПараметр("МодельОборудования", Объект.Ссылка);
	Запрос.УстановитьПараметр("Категория", Объект.Категория);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЗначенияХарактеристик.Добавить();
		
		НоваяСтрока.Характеристика = Выборка.Характеристика;
		НоваяСтрока.Значение = Выборка.Значение;
		НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Категория.ВидНоменклатуры <> Перечисления.ВидыНоменклатуры.МодельОборудования Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаХарактеристик = РеквизитФормыВЗначение("ЗначенияХарактеристик");
	ТехническиеХарактеристикиСервер.ЗаписатьЗначенияХарактеристикМодели(ТекущийОбъект.Ссылка, ТаблицаХарактеристик);
	
КонецПроцедуры


&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	
	ЗаполнитьЗначенияХарактеристик();
	
КонецПроцедуры